# whilee 迴圈
# 這是條件式迴圈當條件成立時,會執行迴圈裡的指令
i = 1
while i <= 10:
    # 當i小於10時,執行回圈內的程式
    print(i)
    i = i + 1

    # 算術指定運算子
    # +=,-=,*=,/=,//=,%=,**=
    # x=x+1等於x+=1
    # x=x-1等於x-=1
    # x=x*1等於x*=1
    # x=x/1等於x/=1
    # x=x//1等於x//=1
    # x=x%1等於x%=1
    # x=x**1等於x**=1

    # 符號優先順序
    # 1.()先執行括號內的運算式
    # 2.**指數運算
    # 3.+-正負號
    # 4.*/  //  %  乘除法,取餘數,整數除法
# 5.+-加減法
# 6.==!=> < >= <= 比較運算
# 7.and or 邏輯運算
# 8.= += -= *= /= //= %= **=

i = 1
while i <= 10:
    print(i)
    i = i + 1  # 等於i=i+1

password = ""
while password != "1234":
    password = input("請輸入密碼:")
    if password == "1234":
        print("歡迎")
    else:
        print("重新輸入")
